Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX460F256L.atdf
      <value-group caption="Line Mask bits" name="CHEMSK__LMASK">
         <value caption="Enables mask logic to force a match on the corresponding bit position in the LTAG(19:0) bits (CHETAG(23:4)) and the physical address." name="" value="0x1" />
         <value caption="Only writeable for values of CHEIDX(3:0) bits (CHEACC(3:0)) equal to 0x0A and 0x0B. Disables mask logic." name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00751" name="PMP" version="1">
      <register-group name="PMP">
         <register caption="Parallel Port Control Register" name="PMCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Read Strobe Polarity bit" mask="0x00000001" name="RDSP" values="PMCON__RDSP" />
            <bitfield caption="Write Strobe Polarity bit" mask="0x00000002" name="WRSP" values="PMCON__WRSP" />
            <bitfield caption="Chip Select 1 Polarity bit" mask="0x00000008" name="CS1P" values="PMCON__CS1P" />
            <bitfield caption="Address Latch Polarity bit" mask="0x00000020" name="ALP" values="PMCON__ALP" />
            <bitfield caption="Chip Select Function bits" mask="0x000000C0" name="CSF" values="PMCON__CSF" />
            <bitfield caption="Read/Write Strobe Port Enable bit" mask="0x00000100" name="PTRDEN" values="PMCON__PTRDEN" />
            <bitfield caption="Write Enable Strobe Port Enable bit" mask="0x00000200" name="PTWREN" values="PMCON__PTWREN" />
            <bitfield caption="PMP Module TTL Input Buffer Select bit" mask="0x00000400" name="PMPTTL" values="PMCON__PMPTTL" />
            <bitfield caption="Address/Data Multiplexing Selection bits" mask="0x00001800" name="ADRMUX" values="PMCON__ADRMUX" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="PMCON__SIDL" />
            <bitfield caption="Parallel Master Port Enable bit" mask="0x00008000" name="ON" values="PMCON__ON" />
         </register>
         <register caption="Parallel Port Mode Register" name="PMMODE" offset="0x10" rw="RW" size="4">
            <bitfield caption="Data Hold After Read/Write Strobe Wait States bits" mask="0x00000003" name="WAITE" values="PMMODE__WAITE" />
            <bitfield caption="Data Read/Write Strobe Wait States bits" mask="0x0000003C" name="WAITM" values="PMMODE__WAITM" />
            <bitfield caption="Data Setup to Read/Write Strobe Wait States bits" mask="0x000000C0" name="WAITB" values="PMMODE__WAITB" />
            <bitfield caption="Parallel Port Mode Select bits" mask="0x00000300" name="MODE" values="PMMODE__MODE" />
            <bitfield caption="Increment Mode bits" mask="0x00001800" name="INCM" values="PMMODE__INCM" />
            <bitfield caption="Interrupt Request Mode bits" mask="0x00006000" name="IRQM" values="PMMODE__IRQM" />
            <bitfield caption="Busy bit (Master mode only)" mask="0x00008000" name="BUSY" values="PMMODE__BUSY" />
         </register>
         <register caption="Parallel Port Address Register" name="PMADDR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="ADDR" />
            <bitfield caption="Chip Select bit" mask="0x0000C000" name="CS" values="PMADDR__CS" />
         </register>
         <register caption="Parallel Port Output Data Register" name="PMDOUT" offset="0x30" rw="RW" size="4">
            <bitfield caption="Port Data Output bits" mask="0xFFFFFFFF" name="DATAOUT" values="PMDOUT__DATAOUT" />
         </register>
         <register caption="Parallel Port Input Data Register" name="PMDIN" offset="0x40" rw="RW" size="4">
            <bitfield caption="Port Data Input bits" mask="0xFFFFFFFF" name="DATAIN" values="PMDIN__DATAIN" />
         </register>
         <register caption="Parallel Port Pin Enable Register" name="PMAEN" offset="0x50" rw="RW" size="4">
            <bitfield caption="PMALH/PMALL Strobe Enable bits" mask="0x0000FFFF" name="PTEN" values="PMAEN__PTEN" />
         </register>
         <register caption="Parallel Port Status Register (Slave modes only)" name="PMSTAT" offset="0x60" rw="RW" size="4">
            <bitfield caption="Output Buffer 0 Status Empty bit" mask="0x00000001" name="OB0E" values="PMSTAT__OB0E" />
            <bitfield caption="Output Buffer 1 Status Empty bit" mask="0x00000002" name="OB1E" values="PMSTAT__OB1E" />
            <bitfield caption="Output Buffer 2 Status Empty bit" mask="0x00000004" name="OB2E" values="PMSTAT__OB2E" />
            <bitfield caption="Output Buffer 3 Status Empty bit" mask="0x00000008" name="OB3E" values="PMSTAT__OB3E" />
            <bitfield caption="Output Buffer Underflow Status bit" mask="0x00000040" name="OBUF" values="PMSTAT__OBUF" />
            <bitfield caption="Output Buffer Empty Status bit" mask="0x00000080" name="OBE" values="PMSTAT__OBE" />
            <bitfield caption="Input Buffer 0 Status Full bit" mask="0x00000100" name="IB0F" values="PMSTAT__IB0F" />
            <bitfield caption="Input Buffer 1 Status Full bit" mask="0x00000200" name="IB1F" values="PMSTAT__IB1F" />
            <bitfield caption="Input Buffer 2 Status Full bit" mask="0x00000400" name="IB2F" values="PMSTAT__IB2F" />
            <bitfield caption="Input Buffer 3 Status Full bit" mask="0x00000800" name="IB3F" values="PMSTAT__IB3F" />
            <bitfield caption="Input Buffer Overflow Status bit" mask="0x00004000" name="IBOV" values="PMSTAT__IBOV" />
            <bitfield caption="Input Buffer Full Status bit" mask="0x00008000" name="IBF" values="PMSTAT__IBF" />
         </register>
      </register-group>
      <value-group caption="Read Strobe Polarity bit" name="PMCON__RDSP">
         <value caption="(Slave and Master mode 2) Read Strobe active-high / (Master mode 1) Read/write strobe active-high" name="" value="0x1" />
         <value caption="(Slave and Master mode 2) Read Strobe active-low / (Master mode 1) Read/write strobe active-low" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Strobe Polarity bit" name="PMCON__WRSP">
         <value caption="(Slave and Master mode 2) Write strobe active-high / (Master mode 1) Enable strobe active-high" name="" value="0x1" />
         <value caption="(Slave and Master mode 2) Write strobe active-low / (Master mode 1) Enable strobe active-low" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 Polarity bit" name="PMCON__CS1P">
         <value caption="Active-high (PMCS1)" name="" value="0x1" />
         <value caption="Active-low (PMCS1)" name="" value="0x0" />
      </value-group>
      <value-group caption="Address Latch Polarity bit" name="PMCON__ALP">
         <value caption="Active-high (PMALL and PMALH)" name="" value="0x1" />
         <value caption="Active-low (PMALL and PMALH)" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select Function bits" name="PMCON__CSF">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="PMCS2 and PMCS1 function as Chip Select" name="" value="0x2" />
         <value caption="PMCS2 functions as Chip Select, PMCS1 functions as address bit 14" name="" value="0x1" />
         <value caption="PMCS2 and PMCS1 function as address bits 15 and 14" name="" value="0x0" />
      </value-group>
      <value-group caption="Read/Write Strobe Port Enable bit" name="PMCON__PTRDEN">
         <value caption="PMRD/PMWR port is enabled" name="" value="0x1" />
         <value caption="PMRD/PMWR port is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Enable Strobe Port Enable bit" name="PMCON__PTWREN">
         <value caption="PMWR/PMENB port is enabled" name="" value="0x1" />
         <value caption="PMWR/PMENB port is disabled" name="" value="0x0" />
      </value-group>
